# Working notebook with exaples

In [499]:
import pandas as pd
import sqlite3
import numpy as np

In [500]:
con = sqlite3.connect('C:/Users/79295/Desktop/GITHUB/SQL/SQL для анализа данных/databases/german_credit.db')

In [505]:
df = pd.read_csv('C:/Users/79295/Desktop/GITHUB/SQL/SQL для анализа данных/datasets/german_credit_augmented.csv')

In [506]:
df.contract_dt = pd.to_datetime(df.contract_dt, format='%Y-%m-%d %H:%M:%S')

In [507]:
# Выгружаем нашу табличку в базу данных

df.to_sql('german_credit', con, index=False,if_exists='replace')

1000

In [508]:
# Заворачиваем функцию  pd.read_sql(sql,con) во вспомогательную функцию select(sql), чтобы меньше печатать 

def select(sql):
    return pd.read_sql(sql,con)

In [509]:
sql = '''select
            t.*,
            t.age * 3 as age_mult3
        from german_credit t
        where t.age < 23 
            and t.purpose = "car"
            and t.housing = "own"
        '''
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id,age_mult3
0,22,male,2,own,rich,moderate,1007,12,car,0,2007-07-17 12:33:24,67,66

In [510]:
sql = '''select
        t.*,
        t.age * 3 as age_mult3
        from german_credit t
        where t.age < 22 
        and t.purpose = "car"
        and t.housing in ("own","rent")
        '''
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id,age_mult3
0,21,female,2,rent,little,None,2570,27,car,1,2008-06-14 22:03:03,724,63
1,20,female,2,rent,None,None,4675,12,car,0,2008-06-06 19:31:48,296,60
2,21,male,2,rent,little,moderate,2779,18,car,0,2008-06-06 15:51:39,425,63
3,20,female,2,rent,rich,None,3186,15,car,0,2008-05-06 18:34:56,420,60
4,20,female,1,rent,little,moderate,2718,24,car,1,2008-04-12 12:34:40,593,60

# Saving query result to new table

In [39]:
cur = con.cursor()

In [50]:
# Создадим запрос в котором сначала будем дропать табличку, чтобы оставалась возможность перезапуска

In [46]:
sql = '''
    drop table if exists my_table; 
    create table 
        my_table as 
    select
        t.*,
        t.age * 3 as age_mult3
    from 
        german_credit t
    where t.age < 22 
        and t.purpose = "car"
        and t.housing in ("own","rent")
    '''

In [47]:
cur.executescript(sql)

In [48]:
sql = '''
select *
from my_table
'''

In [49]:
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id,age_mult3
0,21,female,2,rent,little,None,2570,27,car,1,2008-06-14 22:03:03,724,63
1,20,female,2,rent,None,None,4675,12,car,0,2008-06-06 19:31:48,296,60
2,21,male,2,rent,little,moderate,2779,18,car,0,2008-06-06 15:51:39,425,63
3,20,female,2,rent,rich,None,3186,15,car,0,2008-05-06 18:34:56,420,60
4,20,female,1,rent,little,moderate,2718,24,car,1,2008-04-12 12:34:40,593,60

# Union all

In [53]:
jan = pd.DataFrame({"month":['jan','jan'],"revenue": [100, 150]})
feb = pd.DataFrame({"month":['feb','feb'],"revenue": [120, 160]})

In [56]:
jan.to_sql('jan',con,index=False,if_exists='replace')
feb.to_sql('feb',con,index=False,if_exists='replace')

2

In [61]:
sql='''
select * 
from jan t
union all
select *
from feb t
'''

In [62]:
select(sql)

  month  revenue
0   jan      100
1   jan      150
2   feb      120
3   feb      160

# Getting string letters

In [67]:
# substr(column,x,y) где x - порядковый номер символа в строке, y - кол-во символов
sql = '''select
        substr(t.sex,1,1)
        from german_credit t
        
        '''
select(sql)

    substr(t.sex,1,1)
0                   m
1                   m
2                   m
3                   f
4                   m
..                ...
995                 m
996                 m
997                 m
998                 f
999                 m

[1000 rows x 1 columns]

# Group by

In [72]:
sql='''
select 
t.sex, 
    count(1) as total_count, 
        round(avg(credit_amount),2) as avg_credit
from
    german_credit t
group by 
    t.sex
'''
select(sql)

      sex  total_count  avg_credit
0  female          310     2877.77
1    male          690     3448.04

# Null / NaN values

In [75]:
sql = '''
select count(t.checking_account),count(1)
from
german_credit t

'''
select(sql)

   count(t.checking_account)  count(1)
0                        606      1000

In [76]:
sql='''
select 
    t.checking_account, 
    count(1) as total_count, 
    round(avg(credit_amount),2) as avg_credit
from
    german_credit t
group by 
    t.checking_account
'''
select(sql)

  checking_account  total_count  avg_credit
0             None          394     3133.10
1           little          274     3175.22
2         moderate          269     3827.56
3             rich           63     2177.65

In [78]:
df.groupby('checking_account').credit_amount.count()

checking_account
little      274
moderate    269
rich         63
Name: credit_amount, dtype: int64

In [79]:
df.groupby('checking_account',dropna=False).credit_amount.count()

checking_account
little      274
moderate    269
rich         63
NaN         394
Name: credit_amount, dtype: int64

In [86]:
sql='''
select 
    t.checking_account,
    sum(case when t.checking_account is null then 1 else 0 end) as count_none
from
    german_credit t
'''
select(sql)

  checking_account  count_none
0             None         394

In [89]:
t = pd.DataFrame({'col1':[1,np.nan,2]})

In [90]:
t

   col1
0   1.0
1   NaN
2   2.0

In [91]:
t=t.to_sql('null_test',con,index=False,if_exists='replace')

In [92]:
sql = '''
select *
from
null_test t
'''
select(sql)

   col1
0   1.0
1   NaN
2   2.0

In [93]:
sql = '''
select 
count(t.col1)
from
null_test t
'''
select(sql)

   count(t.col1)
0              2

In [94]:
sql = '''
select 
count(1)
from
null_test t
'''
select(sql)

   count(1)
0         3

In [95]:
sql = '''
select 
sum(t.col1)
from
null_test t
'''
select(sql)

   sum(t.col1)
0          3.0

In [96]:
sql = '''
select 
avg(t.col1)
from
null_test t
'''
select(sql)

   avg(t.col1)
0          1.5

In [97]:
# Заменим пропуски

In [98]:
sql = '''
select 
*
from
german_credit t
'''
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,33,male,2,own,None,None,3074,9,radio/TV,0,2008-06-29 18:52:00,210
1,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
2,52,male,2,own,quite rich,None,936,9,education,0,2008-04-27 08:23:07,200
3,35,female,3,own,little,None,1393,11,car,0,2007-05-06 10:58:22,45
4,28,male,2,own,little,None,776,12,radio/TV,0,2007-07-21 13:22:14,358
...,...,...,...,...,...,...,...,...,...,...,...,...
995,65,male,2,free,little,little,2600,18,radio/TV,1,2007-12-16 20:17:19,624
996,30,male,3,own,little,moderate,4455,36,business,1,2007-07-12 14:08:58,181
997,33,male,2,own,little,moderate,6403,24,radio/TV,0,2008-04-08 03:24:26,730
998,29,female,2,own,None,None,5003,21,car,1,2007-11-29 15:51:45,557
999,44,male,2,own,moderate,moderate,1804,12,car,0,2007-08-14 09:05:33,23

In [101]:
sql = '''
select 
t.checking_account,
coalesce(t.checking_account,'no_info')
from
german_credit t
'''
select(sql)

    checking_account coalesce(t.checking_account,'no_info')
0               None                                no_info
1             little                                 little
2               None                                no_info
3               None                                no_info
4               None                                no_info
..               ...                                    ...
995           little                                 little
996         moderate                               moderate
997         moderate                               moderate
998             None                                no_info
999         moderate                               moderate

[1000 rows x 2 columns]

In [102]:
sql = '''
select 
coalesce(col1,0)
from
null_test t
'''
select(sql)

   coalesce(col1,0)
0               1.0
1               0.0
2               2.0

# coalesce по строке

In [107]:
t = pd.DataFrame({'col1':[1,np.nan,2],
                 'col2':[np.nan,np.nan,1],
                 'col3':[2,3,7]})

In [108]:
t=t.to_sql('null_test',con,index=False,if_exists='replace')

In [109]:
sql = '''
select *
from
null_test t
'''
select(sql)

   col1  col2  col3
0   1.0   NaN     2
1   NaN   NaN     3
2   2.0   1.0     7

In [110]:
sql = '''
select 
coalesce(t.col1, t.col2, t.col3)
from
null_test t
'''
select(sql)

   coalesce(t.col1, t.col2, t.col3)
0                               1.0
1                               3.0
2                               2.0

In [111]:
# Видим, что запрос построчно нашел первые  не NaN значения и вывел их

# Дубликаты

In [112]:
t = pd.DataFrame({'id':[1,1,2],
                 'name':['a', 'a', 'b']})

In [113]:
t=t.to_sql('dupl_test',con,index=False,if_exists='replace')

In [114]:
sql = '''
select *
from
dupl_test t
'''
select(sql)

   id name
0   1    a
1   1    a
2   2    b

In [115]:
# имеем 2 полных дубликата с индексами 0 и 1
# Сгруппируем по всем полям

In [116]:
sql = '''
select t.id, t.name, count(1) as cnt
from
dupl_test t
group by t.id, t.name
'''
select(sql)

   id name  cnt
0   1    a    2
1   2    b    1

In [119]:
sql = '''
select 
    t.id, t.name, count(1) as cnt
from
    dupl_test t
group by 
    t.id, t.name
having cnt > 1
'''
select(sql)

   id name  cnt
0   1    a    2

In [120]:
t = pd.DataFrame({'id':[1,1,2,2,3],
                 'name':['a', 'b', 'c', 'd', 'e']})

In [121]:
t

   id name
0   1    a
1   1    b
2   2    c
3   2    d
4   3    e

In [122]:
t=t.to_sql('dupl_test2',con,index=False,if_exists='replace')

In [123]:
sql = '''
select *
from
dupl_test2 t

'''
select(sql)

   id name
0   1    a
1   1    b
2   2    c
3   2    d
4   3    e

In [124]:
sql = '''
select 
    t.id, t.name, count(1) as cnt
from
    dupl_test2 t
group by 
    t.id, t.name
having cnt > 1
'''
select(sql)

Empty DataFrame
Columns: [id, name, cnt]
Index: []

In [126]:
# Найдем повторяющиеся id

In [127]:
sql = '''
select 
    t.id, count(1) as cnt
from
    dupl_test2 t
group by 
    t.id
having cnt > 1
'''
select(sql)

   id  cnt
0   1    2
1   2    2

In [128]:
sql = '''
select *
from
dupl_test2 t
where t.id in(1,2)

'''
select(sql)

   id name
0   1    a
1   1    b
2   2    c
3   2    d

In [130]:
sql = '''
select 
    t.id
from
    dupl_test2 t
group by 
    t.id
having count(1) > 1
'''
select(sql)

   id
0   1
1   2

In [131]:
sql = '''
select *
from
dupl_test2 t
where t.id in(  select t.id
                from
                dupl_test2 t
                group by t.id
                having count(1) > 1)

'''
select(sql)

   id name
0   1    a
1   1    b
2   2    c
3   2    d

In [133]:
# Аггрегация договоров по месяцам

In [132]:
sql = '''
select *
from
german_credit
'''
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,33,male,2,own,None,None,3074,9,radio/TV,0,2008-06-29 18:52:00,210
1,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
2,52,male,2,own,quite rich,None,936,9,education,0,2008-04-27 08:23:07,200
3,35,female,3,own,little,None,1393,11,car,0,2007-05-06 10:58:22,45
4,28,male,2,own,little,None,776,12,radio/TV,0,2007-07-21 13:22:14,358
...,...,...,...,...,...,...,...,...,...,...,...,...
995,65,male,2,free,little,little,2600,18,radio/TV,1,2007-12-16 20:17:19,624
996,30,male,3,own,little,moderate,4455,36,business,1,2007-07-12 14:08:58,181
997,33,male,2,own,little,moderate,6403,24,radio/TV,0,2008-04-08 03:24:26,730
998,29,female,2,own,None,None,5003,21,car,1,2007-11-29 15:51:45,557
999,44,male,2,own,moderate,moderate,1804,12,car,0,2007-08-14 09:05:33,23

In [141]:
sql = '''
select 
    date(t.contract_dt,'start of month') as month,
    count(1),
    sum(t.credit_amount) as credit_amount_sum,
    round(avg(t.credit_amount),2) as credit_amount_avg,
    count(distinct t.client_id) as client_id_unique
from
    german_credit t
group by 
    date(t.contract_dt,'start of month')
order by 
    date(t.contract_dt,'start of month')
'''
select(sql)

,month,count(1),credit_amount_sum,credit_amount_avg,client_id_unique
0,2007-05-01,81,207663,2563.74,81
1,2007-06-01,74,239594,3237.76,74
2,2007-07-01,71,224333,3159.62,71
3,2007-08-01,57,178569,3132.79,57
4,2007-09-01,58,186909,3222.57,58
5,2007-10-01,70,188534,2693.34,70
6,2007-11-01,87,300504,3454.07,87
7,2007-12-01,77,273973,3558.09,77
8,2008-01-01,93,288080,3097.63,93
9,2008-02-01,55,211128,3838.69,55
10,2008-03-01,63,204944,3253.08,63
11,2008-04-01,85,305409,3593.05,85
12,2008-05-01,67,263043,3926.01,67
13,2008-06-01,62,198575,3202.82,62

# Intervals

In [148]:
sql = '''
select 
    t.credit_amount,
    case 
        when t.credit_amount < 1000 then '1. <1000'
        when t.credit_amount < 2000 then '2. 1000-2000'
        when t.credit_amount < 3000 then '3. 2000-3000'
        when t.credit_amount >= 3000 then '4. >=3000'
        else 'other' 
    end as credeit_amount_bin
from 
    german_credit t

'''
select(sql)

     credit_amount credeit_amount_bin
0             3074          4. >=3000
1             1344       2. 1000-2000
2              936           1. <1000
3             1393       2. 1000-2000
4              776           1. <1000
..             ...                ...
995           2600       3. 2000-3000
996           4455          4. >=3000
997           6403          4. >=3000
998           5003          4. >=3000
999           1804       2. 1000-2000

[1000 rows x 2 columns]

In [154]:
sql = '''
select
    case 
        when t.credit_amount < 1000 then '1. <1000'
        when t.credit_amount < 2000 then '2. 1000-2000'
        when t.credit_amount < 3000 then '3. 2000-3000'
        when t.credit_amount >= 3000 then '4. >=3000'
        else 'other' 
    end as credeit_amount_bin,
    count(1) as credit_cnt
from german_credit t
    group by 
        credeit_amount_bin
'''
select(sql)

  credeit_amount_bin  credit_cnt
0           1. <1000         116
1       2. 1000-2000         316
2       3. 2000-3000         188
3          4. >=3000         380

# Pivot table

In [157]:
sql = '''
select
    t.housing,
    count(1) as cnt
from german_credit t
group by 
    t.housing

'''
select(sql)

  housing  cnt
0    free  108
1     own  713
2    rent  179

In [163]:
sql = '''
select
    t.housing,
    count(case when t.sex='female' then 1 else null end) as female,
    count(case when t.sex='male' then 1 else null end) as male,
    count(1) as cnt
from german_credit t
group by 
    t.housing
'''
select(sql)

  housing  female  male  cnt
0    free      19    89  108
1     own     196   517  713
2    rent      95    84  179

In [166]:
sql = '''
select
distinct t.purpose
from german_credit t
'''
purpose = list(select(sql)['purpose'].values)

In [167]:
purpose

['radio/TV',
 'car',
 'education',
 'furniture/equipment',
 'repairs',
 'business',
 'domestic appliances',
 'vacation/others']

In [181]:
for p in purpose:
    print(f"count(case when t.purpose = '{p}' then 1 else null end) as {p.lower().replace(' ','').replace('/','')},")

count(case when t.purpose = 'radio/TV' then 1 else null end) as radiotv,
count(case when t.purpose = 'car' then 1 else null end) as car,
count(case when t.purpose = 'education' then 1 else null end) as education,
count(case when t.purpose = 'furniture/equipment' then 1 else null end) as furnitureequipment,
count(case when t.purpose = 'repairs' then 1 else null end) as repairs,
count(case when t.purpose = 'business' then 1 else null end) as business,
count(case when t.purpose = 'domestic appliances' then 1 else null end) as domesticappliances,
count(case when t.purpose = 'vacation/others' then 1 else null end) as vacationothers,

In [184]:
sql = '''
select
    t.housing,
    count(case when t.purpose = 'radio/TV' then 1 else null end) as radiotv,
    count(case when t.purpose = 'car' then 1 else null end) as car,
    count(case when t.purpose = 'education' then 1 else null end) as education,
    count(case when t.purpose = 'furniture/equipment' then 1 else null end) as furnitureequipment,
    count(case when t.purpose = 'repairs' then 1 else null end) as repairs,
    count(case when t.purpose = 'business' then 1 else null end) as business,
    count(case when t.purpose = 'domestic appliances' then 1 else null end) as domesticappliances,
    count(case when t.purpose = 'vacation/others' then 1 else null end) as vacationothers,
    count(1) as cnt
from german_credit t
group by 
    t.housing
'''
select(sql)

,housing,radiotv,car,education,furnitureequipment,repairs,business,domesticappliances,vacationothers,cnt
0,free,15,55,15,11,3,5,0,4,108
1,own,227,219,34,122,17,76,10,8,713
2,rent,38,63,10,48,2,16,2,0,179

# Подзапросы

In [196]:
t = pd.DataFrame({'id':[1,1,2,2,3],
                 'name':['a', 'b', 'c', 'd', 'e']})

In [197]:
t

   id name
0   1    a
1   1    b
2   2    c
3   2    d
4   3    e

In [198]:
t = t.to_sql('dupl_test',con,index=False,if_exists='replace')

In [199]:
sql = '''
select *
from
dupl_test t

'''
select(sql)

   id name
0   1    a
1   1    b
2   2    c
3   2    d
4   3    e

In [203]:
sql = '''
select 
    t.id,
    count(1)
from
    dupl_test t
group by t.id
having 
    count(1) > 1

'''
select(sql)

   id  count(1)
0   1         2
1   2         2

In [204]:
sql = '''
select 
    t.id
from
    dupl_test t
group by t.id
having 
    count(1) > 1

'''
select(sql)

   id
0   1
1   2

In [205]:
sql = '''
select *
from
dupl_test t
where t.id in (select 
                    t.id
                from
                    dupl_test t
                group by t.id
                having 
                    count(1) > 1)

'''
select(sql)

   id name
0   1    a
1   1    b
2   2    c
3   2    d

*тоже самое можно сделать сохранив результат подзапроса в промежуточную таблицу, а затем обратиться к ней*

In [207]:
sql = '''
drop table if exists dupls;
create table dupls as 
    select 
        t.id
    from
        dupl_test t
    group by t.id
    having 
        count(1) > 1
'''

In [208]:
cur.executescript(sql)

In [210]:
sql = '''
select * from dupls
'''
select(sql)

   id
0   1
1   2

In [211]:
sql = '''
select *
from
dupl_test t
where t.id in dupls

'''
select(sql)

   id name
0   1    a
1   1    b
2   2    c
3   2    d

# CTE (with)

In [215]:
sql = '''
select 
    * 
from 
    (select 
        * 
    from
        (select 
            t.id, count(1) as cnt 
        from 
            dupl_test t 
        group by t.id) t
    where t.cnt > 1) t

where t.id = 1

'''
select(sql)

   id  cnt
0   1    2

*перепишем это с использованием CTE*

In [220]:
sql = '''
with id_cnt as 
            (select t.id, count(1) as cnt 
            from dupl_test t 
            group by t.id), 

id_cnt_2 as (select *
            from id_cnt t
            where t.cnt > 1)
select * 
from id_cnt_2 t
where t.id = 1
'''
select(sql)

   id  cnt
0   1    2

# Join

In [221]:
users = pd.DataFrame({"id":[1,2,3,],
                    "name":['aaron', 'sergo', 'ivan']})

In [233]:
items = pd.DataFrame({"user_id":[1,2,2,],
                    "item_name":['beer', 'pizza', 'vodka'],
                     'value':[100, 200,120]})

In [241]:
users.to_sql('users', con,index=False, if_exists='replace')
items.to_sql('items', con,index=False, if_exists='replace')

3

In [235]:
sql = '''
select *
from users t 
'''
select(sql)

   id   name
0   1  aaron
1   2  sergo
2   3   ivan

In [236]:
sql = '''
select t.*, i.item_name
from users t 
left join items i
on t.id = i.user_id
'''
select(sql)

   id   name item_name
0   1  aaron      beer
1   2  sergo     pizza
2   2  sergo     vodka
3   3   ivan      None

In [238]:
sql = '''
select t.*, i.item_name, i.value
from users t 
left join items i
on t.id = i.user_id
where i.value is not null
'''
select(sql)

   id   name item_name  value
0   1  aaron      beer    100
1   2  sergo     pizza    200
2   2  sergo     vodka    120

In [239]:
sql = '''
select t.*, i.item_name, i.value
from users t 
left join items i
on t.id = i.user_id

'''
select(sql)

   id   name item_name  value
0   1  aaron      beer  100.0
1   2  sergo     pizza  200.0
2   2  sergo     vodka  120.0
3   3   ivan      None    NaN

In [240]:
users = pd.DataFrame({"id":[1,2,3,],
                    "name":['aaron', 'sergo', 'ivan'],
                     'victory':[2,10,1]})

In [242]:
users.to_sql('users', con,index=False, if_exists='replace')

3

In [244]:
sql = '''
select t.*, i.item_name, i.value, i.user_id
from users t 
left join items i
on t.id = i.user_id
'''
select(sql)

   id   name  victory item_name  value  user_id
0   1  aaron        2      beer  100.0      1.0
1   2  sergo       10     pizza  200.0      2.0
2   2  sergo       10     vodka  120.0      2.0
3   3   ivan        1      None    NaN      NaN

In [245]:
t = select(sql)

In [246]:
t['victory'].sum()

23

In [247]:
sql = '''
select sum(victory)
from users t 

'''
select(sql)

   sum(victory)
0            13

* необходимо проверять на дубликаты
* аггрегировать перед джоином

In [251]:
sql = '''
select 
t.user_id, count(t.item_name) as item_count,
sum(t.value) as value_sum
from items t 
group by t.user_id

'''
select(sql)

   user_id  item_count  value_sum
0        1           1        100
1        2           2        320

In [258]:
sql = '''
with items_agg as (
    select 
    t.user_id, count(t.item_name) as item_count,
    sum(t.value) as value_sum
    from items t 
    group by t.user_id
    )
select 
t.id, t.name, t.victory,
coalesce(i.item_count,0) as item_counn,
coalesce(i.value_sum,0) as value_sum
from users t 
left join items_agg i on
i.user_id = t.id

'''
select(sql)

   id   name  victory  item_counn  value_sum
0   1  aaron        2           1        100
1   2  sergo       10           2        320
2   3   ivan        1           0          0

## Full join

In [511]:
sql = '''select t.*, i.* from users t
left join items i on t.id = i.user_id
union 
select u.*, t.* 
from items t left join users u on t.user_id = u.id
'''

In [512]:
select(sql)

   id   name  victory  user_id item_name  value
0   1  aaron        2      1.0      beer  100.0
1   2  sergo       10      2.0     pizza  200.0
2   2  sergo       10      2.0     vodka  120.0
3   3   ivan        1      NaN      None    NaN

## Inner join

In [513]:
sql = '''select * from german_credit t 
limit 5'''

In [514]:
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,33,male,2,own,None,None,3074,9,radio/TV,0,2008-06-29 18:52:00,210
1,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
2,52,male,2,own,quite rich,None,936,9,education,0,2008-04-27 08:23:07,200
3,35,female,3,own,little,None,1393,11,car,0,2007-05-06 10:58:22,45
4,28,male,2,own,little,None,776,12,radio/TV,0,2007-07-21 13:22:14,358

In [515]:
clients = pd.DataFrame({'client_id':[200,45],'data':[1,2]})

In [516]:
clients.to_sql('clients_task_name',con,index=False,if_exists='replace')

2

In [517]:
sql = '''select t.*, ctn.data from german_credit t 
join clients_task_name ctn on t.client_id = ctn.client_id
'''

In [518]:
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id,data
0,52,male,2,own,quite rich,None,936,9,education,0,2008-04-27 08:23:07,200,1
1,35,female,3,own,little,None,1393,11,car,0,2007-05-06 10:58:22,45,2

In [519]:
sql = '''select 1 as user_id
union all
select 2 as user_id
union all
select 3 as user_id'''

In [520]:
select(sql)

   user_id
0        1
1        2
2        3

In [521]:
sql = '''select date('2021-03-01') as month
union all
select date('2021-04-01') as month
'''

In [522]:
select(sql)

        month
0  2021-03-01
1  2021-04-01

In [523]:
sql = '''
with users as (
select 1 as user_id
union all
select 2 as user_id
union all
select 3 as user_id),

month as

(select date('2021-03-01') as month
union all
select date('2021-04-01') as month)


select * from users t
join month m on 1=1

'''

In [524]:
select(sql)

   user_id       month
0        1  2021-03-01
1        2  2021-03-01
2        3  2021-03-01
3        1  2021-04-01
4        2  2021-04-01
5        3  2021-04-01

## Ежемесячный отчет

In [525]:
sql = '''select * from german_credit t 
limit 5'''

In [526]:
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,33,male,2,own,None,None,3074,9,radio/TV,0,2008-06-29 18:52:00,210
1,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
2,52,male,2,own,quite rich,None,936,9,education,0,2008-04-27 08:23:07,200
3,35,female,3,own,little,None,1393,11,car,0,2007-05-06 10:58:22,45
4,28,male,2,own,little,None,776,12,radio/TV,0,2007-07-21 13:22:14,358

https://drive.google.com/file/d/1ksjv4EsLItdn9rYA4oxislish-c4eE4D/view?usp=sharing

In [262]:
! gdown --id 1ksjv4EsLItdn9rYA4oxislish-c4eE4D

/usr/local/lib/python3.8/dist-packages/gdown/cli.py:127: FutureWarning: Option `--id` was deprecated in version 4.3.1 and will be removed in 5.0. You don't need to pass it anymore to use a file ID.
  warnings.warn(
Downloading...
From: https://drive.google.com/uc?id=1ksjv4EsLItdn9rYA4oxislish-c4eE4D
To: /content/german_credit_augmented_transactions.csv
100% 134k/134k [00:00<00:00, 101MB/s]

In [527]:
transactions = pd.read_csv('C:/Users/79295/Desktop/GITHUB/SQL/SQL для анализа данных/datasets/german_credit_augmented_transactions.csv')

In [528]:
transactions.head()

                    dt  client_id  amount
0  2008-04-06 11:54:47        950  161.38
1  2007-07-28 00:00:19        418   35.34
2  2008-03-14 20:43:54        131  146.50
3  2007-12-18 13:03:24        353  119.21
4  2007-11-09 05:18:30        849  105.24

In [529]:
transactions.to_sql('client_transactions',con,index=False,if_exists='replace')

4275

In [530]:
sql = '''select * from client_transactions t limit 5'''

In [531]:
select(sql)

                    dt  client_id  amount
0  2008-04-06 11:54:47        950  161.38
1  2007-07-28 00:00:19        418   35.34
2  2008-03-14 20:43:54        131  146.50
3  2007-12-18 13:03:24        353  119.21
4  2007-11-09 05:18:30        849  105.24

In [532]:
sql = '''select count(*) from client_transactions t limit 5'''

In [533]:
select(sql)

   count(*)
0      4275

In [534]:
sql = '''select 
date(t.dt, 'start of month') as month,
count(1) as transaction_cnt,
sum(t.amount) as amount_sum

 from client_transactions t
group by 1
order by 1
'''

In [535]:
select(sql)

         month  transaction_cnt  amount_sum
0   2007-05-01              338   450912.77
1   2007-06-01              379   551664.83
2   2007-07-01              304   494134.50
3   2007-08-01              255   426903.23
4   2007-10-01              332   634846.49
5   2007-11-01              389   500420.98
6   2007-12-01              364   561449.89
7   2008-01-01              413   630137.22
8   2008-02-01              228   337043.47
9   2008-03-01              309   425599.09
10  2008-04-01              383   677194.97
11  2008-05-01              310   474962.34
12  2008-06-01              271   383710.84

In [536]:
min = '''select date(min(t.dt),'start of month') from client_transactions t'''

In [537]:
max = '''select date(max(t.dt),'start of month') from client_transactions t'''

In [538]:
select(max)

  date(max(t.dt),'start of month')
0                       2008-06-01

In [539]:
sql = f'''WITH RECURSIVE dates(month) AS (
  VALUES(({min}))
  UNION ALL
  SELECT date(month, '+1 month')
  FROM dates
  WHERE month < ({max})
)
SELECT t.month FROM dates t'''

In [540]:
select(sql)

         month
0   2007-05-01
1   2007-06-01
2   2007-07-01
3   2007-08-01
4   2007-09-01
5   2007-10-01
6   2007-11-01
7   2007-12-01
8   2008-01-01
9   2008-02-01
10  2008-03-01
11  2008-04-01
12  2008-05-01
13  2008-06-01

In [541]:
sql = f'''WITH dates(month) AS (
  VALUES(({min}))
  UNION ALL
  SELECT date(month, '+1 month')
  FROM dates
  WHERE month < ({max})
),
trans_month as

(select 
date(t.dt, 'start of month') as month,
count(1) as transaction_cnt,
sum(t.amount) as amount_sum

 from client_transactions t
group by 1
order by 1)


SELECT t.month,
coalesce(tm.transaction_cnt,0) as transaction_cnt,
coalesce(tm.amount_sum,0) as amount_sum

FROM dates t
left join trans_month tm on t.month = tm.month
order by t.month'''

In [542]:
select(sql)

         month  transaction_cnt  amount_sum
0   2007-05-01              338   450912.77
1   2007-06-01              379   551664.83
2   2007-07-01              304   494134.50
3   2007-08-01              255   426903.23
4   2007-09-01                0        0.00
5   2007-10-01              332   634846.49
6   2007-11-01              389   500420.98
7   2007-12-01              364   561449.89
8   2008-01-01              413   630137.22
9   2008-02-01              228   337043.47
10  2008-03-01              309   425599.09
11  2008-04-01              383   677194.97
12  2008-05-01              310   474962.34
13  2008-06-01              271   383710.84

## Ежемесячный отчет на пользователя

In [543]:
sql = '''select distinct t.client_id from german_credit t'''

In [544]:
select(sql)

     client_id
0          210
1          929
2          200
3           45
4          358
..         ...
995        624
996        181
997        730
998        557
999         23

[1000 rows x 1 columns]

In [545]:
sql = '''select 
date(t.dt, 'start of month') as month,
t.client_id,
count(1) as transaction_cnt,
sum(t.amount) as amount_sum

 from client_transactions t
group by 1,2
order by 1'''

In [546]:
select(sql)

           month  client_id  transaction_cnt  amount_sum
0     2007-05-01        101                1      149.67
1     2007-05-01        107                2      217.50
2     2007-05-01        110                1     1081.32
3     2007-05-01        111                1      139.97
4     2007-05-01        113                1     1051.29
...          ...        ...              ...         ...
3551  2008-06-01        983                1    10050.37
3552  2008-06-01        987                1      192.48
3553  2008-06-01        992                1     -610.21
3554  2008-06-01        996                1      121.28
3555  2008-06-01        999                1     -641.25

[3556 rows x 4 columns]

In [547]:
sql = f'''WITH dates(month) AS (
  VALUES(({min}))
  UNION ALL
  SELECT date(month, '+1 month')
  FROM dates
  WHERE month < ({max})
),

clients as (select distinct t.client_id from german_credit t),

clients_month as

(SELECT t.month, c.client_id FROM dates t
join clients c on 1=1),

trans_month as 

(select 
date(t.dt, 'start of month') as month,
t.client_id,
count(1) as transaction_cnt,
sum(t.amount) as amount_sum

 from client_transactions t
group by 1,2
order by 1),

client_trans_month as (

select t.*,
tm.transaction_cnt,
tm.amount_sum,
1 as user,
case when tm.transaction_cnt > 0 then 1 else 0 end as active

 from clients_month t
left join trans_month tm on t.client_id = tm.client_id
and t.month = tm.month
)

select t.month, sum(t.user) as user_cnt, sum(t.amount_sum) as amount_sum , 
sum(t.active) as active_cnt from client_trans_month t
group by t.month
'''

In [548]:
t = select(sql)

In [549]:
sql = '''select sum(t.amount) from client_transactions t'''

In [550]:
select(sql)

   sum(t.amount)
0     6548980.62

In [551]:
t['amount_sum'].sum()

6548980.619999999

In [552]:
t

         month  user_cnt  amount_sum  active_cnt
0   2007-05-01      1000   450912.77         288
1   2007-06-01      1000   551664.83         297
2   2007-07-01      1000   494134.50         259
3   2007-08-01      1000   426903.23         222
4   2007-09-01      1000         NaN           0
5   2007-10-01      1000   634846.49         283
6   2007-11-01      1000   500420.98         323
7   2007-12-01      1000   561449.89         287
8   2008-01-01      1000   630137.22         325
9   2008-02-01      1000   337043.47         204
10  2008-03-01      1000   425599.09         267
11  2008-04-01      1000   677194.97         301
12  2008-05-01      1000   474962.34         263
13  2008-06-01      1000   383710.84         237

In [553]:
2 * 365 * 10000

7300000

## Джойн таблицы самой на себя (нарастающий итог)

In [554]:
t = pd.DataFrame({'dt':pd.to_datetime(['2021-04-01','2021-04-02','2021-04-03'],format='%Y-%m-%d'),
                  'revenue':[1,2,3]})

In [555]:
t

          dt  revenue
0 2021-04-01        1
1 2021-04-02        2
2 2021-04-03        3

In [556]:
t.to_sql('revenue',con,index=False,if_exists='replace')

3

In [557]:
sql = '''select 
t.dt,t.revenue, sum(r.revenue) as cumsum from revenue t
join revenue r on r.dt <= t.dt 
group by t.dt, t.revenue'''

In [558]:
select(sql)

                    dt  revenue  cumsum
0  2021-04-01 00:00:00        1       1
1  2021-04-02 00:00:00        2       3
2  2021-04-03 00:00:00        3       6

# Оконные функции

## Что такое оконная функция?

In [559]:
sql = '''select t.*,
sum(t.revenue) over (order by t.dt) as cum_sum
from revenue t'''

In [560]:
select(sql)

                    dt  revenue  cum_sum
0  2021-04-01 00:00:00        1        1
1  2021-04-02 00:00:00        2        3
2  2021-04-03 00:00:00        3        6

In [561]:
t = pd.DataFrame({'user_id':[1,1,1,2,2,2],'dt':pd.to_datetime(['2021-04-01','2021-04-02','2021-04-03',
                                                               '2021-04-01','2021-04-02','2021-04-03'],format='%Y-%m-%d'),
                  'revenue':[1,2,3,2,3,4]})

In [562]:
t

   user_id         dt  revenue
0        1 2021-04-01        1
1        1 2021-04-02        2
2        1 2021-04-03        3
3        2 2021-04-01        2
4        2 2021-04-02        3
5        2 2021-04-03        4

In [563]:
t.to_sql('revenue',con,index=False,if_exists='replace')

6

In [564]:
sql = '''select t.*,
sum(t.revenue) over (partition by t.user_id order by t.dt) as cum_sum
from revenue t'''

In [565]:
select(sql)

   user_id                   dt  revenue  cum_sum
0        1  2021-04-01 00:00:00        1        1
1        1  2021-04-02 00:00:00        2        3
2        1  2021-04-03 00:00:00        3        6
3        2  2021-04-01 00:00:00        2        2
4        2  2021-04-02 00:00:00        3        5
5        2  2021-04-03 00:00:00        4        9

In [566]:
2 * 365 * 10000

## Джойн таблицы самой на себя (нарастающий итог)

t = pd.DataFrame({'dt':pd.to_datetime(['2021-04-01','2021-04-02','2021-04-03'],format='%Y-%m-%d'),
                  'revenue':[1,2,3]})

t

t.to_sql('revenue',con,index=False,if_exists='replace')

sql = '''select 
t.dt,t.revenue, sum(r.revenue) as cumsum from revenue t
join revenue r on r.dt <= t.dt 
group by t.dt, t.revenue'''

select(sql)

# Оконные функции

## Что такое оконная функция?

sql = '''select t.*,
sum(t.revenue) over (order by t.dt) as cum_sum
from revenue t'''

select(sql)

t = pd.DataFrame({'user_id':[1,1,1,2,2,2],'dt':pd.to_datetime(['2021-04-01','2021-04-02','2021-04-03',
                                                               '2021-04-01','2021-04-02','2021-04-03'],format='%Y-%m-%d'),
                  'revenue':[1,2,3,2,3,4]})

t

t.to_sql('revenue',con,index=False,if_exists='replace')

sql = '''select t.*,
sum(t.revenue) over (partition by t.user_id order by t.dt) as cum_sum
from revenue t'''

select(sql)

   user_id                   dt  revenue  cum_sum
0        1  2021-04-01 00:00:00        1        1
1        1  2021-04-02 00:00:00        2        3
2        1  2021-04-03 00:00:00        3        6
3        2  2021-04-01 00:00:00        2        2
4        2  2021-04-02 00:00:00        3        5
5        2  2021-04-03 00:00:00        4        9

## Rank и row_number

In [567]:
t = pd.DataFrame({'user_id':[1,1,1,1,2,2,2],'dt':pd.to_datetime(['2021-04-01','2021-04-02','2021-04-03','2021-04-03',
                                                               '2021-04-03','2021-04-04','2021-04-05'],format='%Y-%m-%d'),
                  'revenue':[1,2,3,1,2,3,4]})

In [568]:
t.to_sql('revenue',con,index=False,if_exists='replace')

7

In [569]:
sql = '''select * from revenue t'''

In [570]:
select(sql)

   user_id                   dt  revenue
0        1  2021-04-01 00:00:00        1
1        1  2021-04-02 00:00:00        2
2        1  2021-04-03 00:00:00        3
3        1  2021-04-03 00:00:00        1
4        2  2021-04-03 00:00:00        2
5        2  2021-04-04 00:00:00        3
6        2  2021-04-05 00:00:00        4

In [571]:
sql = '''select t.*,

rank() over (partition by t.user_id order by t.dt desc) as rnk

 from revenue t'''

In [572]:
select(sql)

   user_id                   dt  revenue  rnk
0        1  2021-04-03 00:00:00        3    1
1        1  2021-04-03 00:00:00        1    1
2        1  2021-04-02 00:00:00        2    3
3        1  2021-04-01 00:00:00        1    4
4        2  2021-04-05 00:00:00        4    1
5        2  2021-04-04 00:00:00        3    2
6        2  2021-04-03 00:00:00        2    3

In [573]:
sql = '''
with dt_rank as (

select t.*,

rank() over (partition by t.user_id order by t.dt desc) as rnk

 from revenue t)
 
 select * from dt_rank t
where t.rnk = 1
 
 '''

In [574]:
select(sql)

   user_id                   dt  revenue  rnk
0        1  2021-04-03 00:00:00        3    1
1        1  2021-04-03 00:00:00        1    1
2        2  2021-04-05 00:00:00        4    1

In [575]:
sql = '''select t.*,

row_number() over (partition by t.user_id order by t.dt desc) as rnk

 from revenue t'''

In [576]:
select(sql)

   user_id                   dt  revenue  rnk
0        1  2021-04-03 00:00:00        3    1
1        1  2021-04-03 00:00:00        1    2
2        1  2021-04-02 00:00:00        2    3
3        1  2021-04-01 00:00:00        1    4
4        2  2021-04-05 00:00:00        4    1
5        2  2021-04-04 00:00:00        3    2
6        2  2021-04-03 00:00:00        2    3

In [577]:
sql = '''
with dt_rank as (

select t.*,

row_number() over (partition by t.user_id order by t.dt desc) as rnk

 from revenue t)
 
 select * from dt_rank t
where t.rnk = 1
 
 '''

In [578]:
select(sql)

   user_id                   dt  revenue  rnk
0        1  2021-04-03 00:00:00        3    1
1        2  2021-04-05 00:00:00        4    1

In [579]:
t = pd.DataFrame({'user_id':[1,1,1,2,2,2],'dt':pd.to_datetime(['2021-04-01','2021-04-02','2021-04-03',
                                                               '2021-04-03','2021-04-04','2021-04-05'],format='%Y-%m-%d'),
                  'revenue':[1,2,3,2,3,4]})

In [580]:
t.to_sql('revenue',con,index=False,if_exists='replace')

6

In [581]:
sql = '''select t.user_id, max(t.dt) as max_dt from revenue t
group by t.user_id'''

In [582]:
select(sql)

   user_id               max_dt
0        1  2021-04-03 00:00:00
1        2  2021-04-05 00:00:00

In [583]:
sql = '''

with last_dt as (
select t.user_id, max(t.dt) as max_dt from revenue t
group by t.user_id)

select t.* from revenue t
join last_dt ld on t.user_id = ld.user_id and t.dt = ld.max_dt

'''

In [584]:
select(sql)

   user_id                   dt  revenue
0        1  2021-04-03 00:00:00        3
1        2  2021-04-05 00:00:00        4

## Топ 3 зарплаты в отделе

In [585]:
t = pd.DataFrame({'dep':['a','a','a','a','a',
                         'b','b','b','b','b'],
                  'emp':['aa','bb','cc','dd','ee',
                         'aa','bb','cc','dd','ee'],
                  'sal':[5,5,3,2,1,
                         5,4,3,2,1]})

In [586]:
t

  dep emp  sal
0   a  aa    5
1   a  bb    5
2   a  cc    3
3   a  dd    2
4   a  ee    1
5   b  aa    5
6   b  bb    4
7   b  cc    3
8   b  dd    2
9   b  ee    1

In [587]:
t.to_sql('salary',con,index=False,if_exists='replace')

10

In [588]:
sql = '''select t.*,
rank() over (partition by t.dep order by t.sal desc) as rnk_rank,
dense_rank() over (partition by t.dep order by t.sal desc) as rnk

 from salary t'''

In [589]:
select(sql)

  dep emp  sal  rnk_rank  rnk
0   a  aa    5         1    1
1   a  bb    5         1    1
2   a  cc    3         3    2
3   a  dd    2         4    3
4   a  ee    1         5    4
5   b  aa    5         1    1
6   b  bb    4         2    2
7   b  cc    3         3    3
8   b  dd    2         4    4
9   b  ee    1         5    5

In [590]:
sql = '''

with salary_rnk as (

select t.*,

dense_rank() over (partition by t.dep order by t.sal desc) as rnk

 from salary t)
 
 select * from salary_rnk t

where t.rnk <= 3

 
 '''

In [591]:
select(sql)

  dep emp  sal  rnk
0   a  aa    5    1
1   a  bb    5    1
2   a  cc    3    2
3   a  dd    2    3
4   b  aa    5    1
5   b  bb    4    2
6   b  cc    3    3

## Клиентские сессии

In [592]:
user1 = pd.DataFrame({'user_id':[1,1,1,1,1],
                  'dt':pd.to_datetime(['2021-04-01 07:31','2021-04-01 07:35',
                                       '2021-04-01 08:20','2021-04-01 12:31',
                                       '2021-04-03 07:31'],format='%Y-%m-%d %H:%M')})

In [593]:
user1

   user_id                  dt
0        1 2021-04-01 07:31:00
1        1 2021-04-01 07:35:00
2        1 2021-04-01 08:20:00
3        1 2021-04-01 12:31:00
4        1 2021-04-03 07:31:00

In [594]:
user2 = pd.DataFrame({'user_id':[2,2,2,2],
                  'dt':pd.to_datetime(['2021-04-01 07:31','2021-04-01 07:35',
                                       '2021-04-01 08:20','2021-04-01 9:10',
                                       ],format='%Y-%m-%d %H:%M')})

In [595]:
user3 = pd.DataFrame({'user_id':[3,3,3],
                  'dt':pd.to_datetime(['2021-04-01 07:31','2021-04-02 07:35',
                                       '2021-04-03 08:20'
                                       ],format='%Y-%m-%d %H:%M')})

In [596]:
t = pd.concat([user1,user2,user3])

In [597]:
t

   user_id                  dt
0        1 2021-04-01 07:31:00
1        1 2021-04-01 07:35:00
2        1 2021-04-01 08:20:00
3        1 2021-04-01 12:31:00
4        1 2021-04-03 07:31:00
0        2 2021-04-01 07:31:00
1        2 2021-04-01 07:35:00
2        2 2021-04-01 08:20:00
3        2 2021-04-01 09:10:00
0        3 2021-04-01 07:31:00
1        3 2021-04-02 07:35:00
2        3 2021-04-03 08:20:00

In [598]:
t.to_sql('client_log',con,index=False,if_exists='replace')

12

In [599]:
sql = '''select * from client_log t'''

In [600]:
select(sql)

    user_id                   dt
0         1  2021-04-01 07:31:00
1         1  2021-04-01 07:35:00
2         1  2021-04-01 08:20:00
3         1  2021-04-01 12:31:00
4         1  2021-04-03 07:31:00
5         2  2021-04-01 07:31:00
6         2  2021-04-01 07:35:00
7         2  2021-04-01 08:20:00
8         2  2021-04-01 09:10:00
9         3  2021-04-01 07:31:00
10        3  2021-04-02 07:35:00
11        3  2021-04-03 08:20:00

In [601]:
24 * 60 * 60

86400

In [602]:
sql = '''
with new_session as (
select t.*,
lag(t.dt) over (partition by t.user_id order by t.dt) as prev_dt,
round((julianday(t.dt) - julianday(lag(t.dt) over (partition by t.user_id order by t.dt))) * 24 * 60 * 60) as dt_diff,


case when round((julianday(t.dt) - julianday(lag(t.dt) over (partition by t.user_id order by t.dt))) * 24 * 60 * 60) >= 3600
then 1 else 0 end as new_session

 from client_log t),

 client_sessions as (
 
 select t.*,
 
 sum(t.new_session) over (partition by t.user_id order by t.dt) as session_id
 
  from new_session t),

  client_sessions_agg as (

  select t.user_id, t.session_id, count(1) as action_cnt from client_sessions t
  group by t.user_id, t.session_id)


  select count(*) from client_sessions_agg t
 
 '''

In [603]:
select(sql)

   count(*)
0         7

## Скользящее среднее

In [604]:
t = pd.DataFrame({'user_id':[1,1,1,1,1,1,
                             2,2,2,2,2],
                  'dt':[1,2,3,4,5,6,
                        1,2,3,4,5],
                  'revenue':[1,2,3,4,5,6,
                             3,4,5,6,7]})

In [605]:
t.to_sql('revenue',con,index=False,if_exists='replace')

11

In [606]:
sql = '''select t.*,

avg(t.revenue) over (partition by t.user_id order by t.dt

rows between 2 preceding and current row

) as moving_avg

 from revenue t'''

In [607]:
select(sql)

    user_id  dt  revenue  moving_avg
0         1   1        1         1.0
1         1   2        2         1.5
2         1   3        3         2.0
3         1   4        4         3.0
4         1   5        5         4.0
5         1   6        6         5.0
6         2   1        3         3.0
7         2   2        4         3.5
8         2   3        5         4.0
9         2   4        6         5.0
10        2   5        7         6.0